{
    "data":[
        {
            "nome": "NodeJS",
            "descricao": "Trabalho com Node.js para desenvolver aplicativos de servidor escaláveis e eficientes. Utilizo essa tecnologia para criar APIs robustas e serviços de backend que podem lidar com grande quantidade de requisições simultâneas.",
            "img": "./static/img/node.jfif"
        },
        {
            "nome": "React",
            "descricao": "Utilizo React para construir interfaces de usuário interativas e dinâmicas. Com essa biblioteca, desenvolvo componentes reutilizáveis que facilitam a manutenção e a escalabilidade das aplicações front-end.",
            "img": "./static/img/react.jfif"
        },
        {
            "nome": "Git",
            "descricao": "Utilizo Git para controle de versão, permitindo colaboração eficiente em projetos de software. Com Git, rastreio alterações no código, gerencio branches e realizo merges de forma segura e organizada.",
            "img": "./static/img/sql.jfif"
        },
        {
            "nome": "SQL",
            "descricao": "Trabalho com diversos bancos de dados SQL relacionais e não relacionais para armazenar e gerenciar dados de forma eficiente. Tenho experiência em modelagem de dados, consultas complexas e otimização de performance.",
            "img": "./static/img/sql.jfif"
        },
        {
            "nome": "Javascript",
            "descricao": "Programo em JavaScript para adicionar funcionalidades interativas às páginas web. Com essa linguagem, manipulo o DOM, realizo requisições assíncronas e crio experiências de usuário envolventes.",
            "img": "./static/img/javascript.jfif"
        },
        {
            "nome": "Typescript",
            "descricao": "Escrevo código em TypeScript para garantir maior segurança e robustez nas minhas aplicações. A tipagem estática ajuda a identificar erros mais cedo no desenvolvimento, tornando o código mais fácil de manter e escalar.",
            "img": "./static/img/typescript.jfif"
        }
    ]
}